In [1047]:
import re
import pandas as pd
from pandas.io.json import json_normalize
import numpy as np
import requests

# you must populate this dict with the schools required -> try talking to the teaching team about this

schools = {   
    'flatiron-school' : 10748,
    'general-assembly' :10761,
    'data-science-dojo' : 10685,
    'ironhack' : 10828,
    'le-wagon' : 10868,
    'wild-code-school' : 11169,
    'the-dev-masters' : 11077,
    'byte-academy' : 10574,
    'the-data-incubator' : 11074,
    "brainstation" : 10571,
    }

def get_comments_school(school):
    TAG_RE = re.compile(r'<[^>]+>')
    # defines url to make api call to data -> dynamic with school if you want to scrape competition
    url = "https://www.switchup.org/chimera/v1/school-review-list?mainTemplate=school-review-list&path=%2Fbootcamps%2F" + school + "&isDataTarget=false&page=3&perPage=10000&simpleHtml=true&truncationLength=250"
    #makes get request and converts answer to json
    # url defines the page of all the information, request is made, and information is returned to data variable
    data = requests.get(url).json()
    #converts json to dataframe
    reviews =  pd.DataFrame(data['content']['reviews'])

  
    #aux function to apply regex and remove tags
    def remove_tags(x):
        return TAG_RE.sub('',x)
    reviews['review_body'] = reviews['body'].apply(remove_tags)
    reviews['school'] = school
    return reviews

In [1048]:
# could you write this as a list comprehension?
# comments = [comments.append(get_comments_school(school)) for school in schools.keys()]

comments = []

for school in schools.keys():
    print(school)
    comments.append(get_comments_school(school))

comments = pd.concat(comments)

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [1049]:
comments.head(2)

,id,name,anonymous,hostProgramName,graduatingYear,isAlumni,jobTitle,tagline,body,rawBody,...,queryDate,program,user,overallScore,comments,overall,curriculum,jobSupport,review_body,school
0,297686,Anonymous,True,None,2021.0,False,Software Engineer,Waste of time. They want your money.,"<span class=""truncatable""><p></p><p>I found my...",<p>I found my therapist through Flatiron. That...,...,2023-02-07,Online Software Engineering,{'image': None},1.3,[],1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school
1,290538,Anonymous,True,None,2020.0,False,,Negative experience,"<span class=""truncatable""><p></p><p>I have a m...",<p>I have a money-back guarantee with them for...,...,2022-07-09,None,{'image': None},1.7,[],2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school

In [1050]:
comments['school_id'] = comments["school"].map(schools)

In [1051]:
comments.drop(['anonymous', 'hostProgramName', 'body', 'rawBody', 'user', 'comments', 'overallScore','queryDate' ], axis=1, inplace = True, errors='ignore')

In [1052]:
comments.tail(2)

,id,name,graduatingYear,isAlumni,jobTitle,tagline,createdAt,program,overall,curriculum,jobSupport,review_body,school,school_id
307,232910,Anonymous,2015.0,True,None,Built my first iOS app!,10/24/2015,iOS Development,5.0,NaN,NaN,I am enrolled in the Intro to iOS Development ...,brainstation,10571
308,232524,Anonymous,NaN,False,None,Amazing Learning Experience,7/21/2015,Digital Marketing,5.0,5.0,2.0,I was registered for the digital marketing cla...,brainstation,10571

In [1053]:
comments.rename(columns  = {'id' : 'comment_id', 'name' : 'student_name', 'graduatingYear' : 'graduation_year', 'isAlumni': 'alumni', 'jobTitle' : 'job_title', 'tagline' : 'review_tag', 'createdAt' : 'review_date', 'overall':'overall_rating', 'curriculum': 'course_rating', 'jobSupport': 'support_rating', 'review_body' : 'comment'}, inplace = True)

In [1054]:

#comments['graduation_year'] = comments.graduation_year.apply(np.round).astype("Int64") 
comments['graduation_year'] = comments.graduation_year.round().astype("Int64")

In [1055]:
comments.head(2)

,comment_id,student_name,graduation_year,alumni,job_title,review_tag,review_date,program,overall_rating,course_rating,support_rating,comment,school,school_id
0,297686,Anonymous,2021,False,Software Engineer,Waste of time. They want your money.,2/7/2023,Online Software Engineering,1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school,10748
1,290538,Anonymous,2020,False,,Negative experience,7/9/2022,None,2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school,10748

In [1056]:
import mysql.connector

In [1057]:
# Import module
import pymysql
import getpass  # to view password print the password
password= getpass.getpass()

In [1058]:
#  establishing a connection to a database --> group of tables
cnx = mysql.connector.connect(user ='root',
                             password = password,
                             host = 'localhost',
                             database = 'sys',
                             auth_plugin = 'mysql_native_password')

In [1059]:
# check if the connection was successful
cnx.is_connected()

True

In [1060]:
# import the module
from sqlalchemy import create_engine

# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw= password,
                               db="project"))

In [1061]:
cursor = cnx.cursor()
cursor

In [1062]:
query = ('''CREATE DATABASE IF NOT EXISTS project;''')

In [1063]:
cursor.execute(query)

In [1064]:
# export DataFrame comments to SQL
comments.to_csv("comments.csv")
comments.to_sql("comments", engine, if_exists = 'replace', index = False)

5800

In [1065]:
from pandas import json_normalize

def get_school_info(school, school_id):
    url = 'https://www.switchup.org/chimera/v1/bootcamp-data?mainTemplate=bootcamp-data%2Fdescription&path=%2Fbootcamps%2F'+ str(school) + '&isDataTarget=false&bootcampId='+ str(school_id) + '&logoTag=logo&truncationLength=250&readMoreOmission=...&readMoreText=Read%20More&readLessText=Read%20Less'

    data = requests.get(url).json()

    data.keys()

    courses = data['content']['courses']
    courses_df = pd.DataFrame(courses, columns= ['courses'])

    locations = data['content']['locations']
    locations_df = json_normalize(locations)

    badges_df = pd.DataFrame(data['content']['meritBadges'])
    
    website = data['content']['webaddr']
    description = data['content']['description']
    logoUrl = data['content']['logoUrl']
    school_df = pd.DataFrame([website,description,logoUrl]).T
    school_df.columns =  ['website','description','LogoUrl']

    locations_df['school'] = school
    courses_df['school'] = school
    badges_df['school'] = school
    school_df['school'] = school
    

    locations_df['school_id'] = school_id
    courses_df['school_id'] = school_id
    badges_df['school_id'] = school_id
    school_df['school_id'] = school_id

    return locations_df, courses_df, badges_df, school_df

locations_list = []
courses_list = []
badges_list = []
schools_list = []

for school, id in schools.items():
    print(school)
    a,b,c,d = get_school_info(school,id)
    
    locations_list.append(a)
    courses_list.append(b)
    badges_list.append(c)
    schools_list.append(d)

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [1066]:
locations = pd.concat(locations_list)
locations.drop(['description','country.id', 'country.abbrev', 'state.id', 'state.abbrev', 'state.keyword', 'city.id', 'city.keyword'], axis = 1, inplace = True, errors = "ignore")
locations.head(2)

      id   country.name state.name city.name           school  school_id
0  15743  United States   New York       NYC  flatiron-school      10748
1  16257            NaN     Online       NaN  flatiron-school      10748

In [1067]:
locations.rename(columns = {'id' : 'location_id', "country.name" : "country_name", 'state.name' : "state_name", 'city.name' : 'city_name'}, inplace = True)

In [1068]:
locations.to_csv('locations.csv')
locations.to_sql('locations', engine, if_exists = 'replace', index = False)
locations

,location_id,country_name,state_name,city_name,school,school_id
0,15743,United States,New York,NYC,flatiron-school,10748
1,16257,NaN,Online,NaN,flatiron-school,10748
2,16761,United States,Colorado,Denver,flatiron-school,10748
3,16958,United Kingdom,NaN,London,flatiron-school,10748
0,16360,United States,New York,NYC,general-assembly,10761
...,...,...,...,...,...,...
3,16909,United States,Massachusetts,Boston,brainstation,10571
4,16910,United States,Illinois,Chicago,brainstation,10571
5,16940,NaN,Online,NaN,brainstation,10571
6,17706,United States,Florida,Miami,brainstation,10571
7,17731,United Kingdom,NaN,London,brainstation,10571

In [1069]:
courses = pd.concat(courses_list)
courses.head(20)

,courses,school,school_id
0,Cybersecurity Engineering,flatiron-school,10748
1,Data Science,flatiron-school,10748
2,Product Design (UX/UI),flatiron-school,10748
3,Software Engineering,flatiron-school,10748
4,Flatiron Schoolâ€™s â€˜Intro to Product Designâ€™ le...,flatiron-school,10748
5,Flatiron Schoolâ€™s Learn Cybersecurity for Free...,flatiron-school,10748
6,Flatiron Schoolâ€™s Learn Data Science for Free....,flatiron-school,10748
7,Flatiron Schoolâ€™s Learn to Code for Free. Sign up,flatiron-school,10748
8,Online Cybersecurity Engineering,flatiron-school,10748
9,Online Data Science,flatiron-school,10748
10,Online Software Engineering,flatiron-school,10748
0,Data Analytics (Part-Time),general-assembly,10761
1,Data Analytics Immersive,general-assembly,10761
2,Data Science (Part-Time),general-assembly,10761
3,Data Science Immersive,general-assembly,10761
4,Digital Marketing (Part-Time),general-assembly,10761
5,Front-End Web Development (Part-Time),general-assembly,10761
6,Product Management (Part-Time),general-assembly,10761
7,Python Programming (Part-Time),general-assembly,10761
8,React Development (Part-Time),general-assembly,10761

In [1099]:
# Define a function to categorize course names
def categorize_course_name(course_name):
    if ('data' or 'science' or 'analytics' or 'science') in course_name.lower():
        return 'data analytics'
    elif ('development' or 'react' or 'full stack')  in course_name.lower():
        return 'web development'
    elif ('ux' or 'ui' or 'product' or 'experience') in course_name.lower():
        return 'ux/ui'
    else:
        return 'others'

# Add a new column to the DataFrame to store the course categorical name
courses['course_name'] = courses['courses'].apply(categorize_course_name)

# Count the number of courses in each category
course_list = list(courses['course_name'].unique())
course_id = [1001, 1002, 1003, 1004]
course_df = pd.DataFrame({"course_name": course_list, "course_id" : course_id})

In [1105]:
courses['course_id'] = courses['course_name'].map(course_df.set_index('course_name')['course_id'])
course_df.to_csv('course_name.csv')
course_df.to_sql('course_name', engine, if_exists = 'fail', index = False)

4

In [1106]:
courses['course_type'] = np.where(courses.courses.str.contains('Online', case=False), 'online', 'in-class')

In [1107]:
courses.head(20)

,courses,school,school_id,course_name,course_type,course_id
0,Cybersecurity Engineering,flatiron-school,10748,others,in-class,1001
1,Data Science,flatiron-school,10748,data analytics,in-class,1002
2,Product Design (UX/UI),flatiron-school,10748,ux/ui,in-class,1003
3,Software Engineering,flatiron-school,10748,others,in-class,1001
4,Flatiron Schoolâ€™s â€˜Intro to Product Designâ€™ le...,flatiron-school,10748,others,in-class,1001
5,Flatiron Schoolâ€™s Learn Cybersecurity for Free...,flatiron-school,10748,others,in-class,1001
6,Flatiron Schoolâ€™s Learn Data Science for Free....,flatiron-school,10748,data analytics,in-class,1002
7,Flatiron Schoolâ€™s Learn to Code for Free. Sign up,flatiron-school,10748,others,in-class,1001
8,Online Cybersecurity Engineering,flatiron-school,10748,others,online,1001
9,Online Data Science,flatiron-school,10748,data analytics,online,1002
10,Online Software Engineering,flatiron-school,10748,others,online,1001
0,Data Analytics (Part-Time),general-assembly,10761,data analytics,in-class,1002
1,Data Analytics Immersive,general-assembly,10761,data analytics,in-class,1002
2,Data Science (Part-Time),general-assembly,10761,data analytics,in-class,1002
3,Data Science Immersive,general-assembly,10761,data analytics,in-class,1002
4,Digital Marketing (Part-Time),general-assembly,10761,others,in-class,1001
5,Front-End Web Development (Part-Time),general-assembly,10761,web development,in-class,1004
6,Product Management (Part-Time),general-assembly,10761,others,in-class,1001
7,Python Programming (Part-Time),general-assembly,10761,others,in-class,1001
8,React Development (Part-Time),general-assembly,10761,web development,in-class,1004

In [1073]:
courses.to_csv('coursses.csv')
courses.to_sql('courses', engine, if_exists = 'replace', index = False)

84

In [1074]:
badges = pd.concat(badges_list)
badges['description'] = badges['description'].str.replace(r'<[^<>]*>', '', regex=True)
badges.head()

,name,keyword,description,school,school_id
0,Available Online,available_online,School offers fully online courses,flatiron-school,10748
1,Verified Outcomes,verified_outcomes,School publishes a third-party verified outcom...,flatiron-school,10748
2,Flexible Classes,flexible_classes,School offers part-time and evening classes,flatiron-school,10748
3,Accepts GI Bill,accepts_gi_bill,School accepts the GI Bill,flatiron-school,10748
0,Available Online,available_online,School offers fully online courses,general-assembly,10761

In [1075]:
badge_list = list(badges.name.unique())
badge_id = [101, 102, 103, 104]
badge_df = pd.DataFrame({"badge": badge_list, "badge_id" : badge_id})
badge_df

               badge  badge_id
0   Available Online       101
1  Verified Outcomes       102
2   Flexible Classes       103
3    Accepts GI Bill       104

In [ ]:
badges['badge_id'] = badges['name'].map(badge_df.set_index('badge')['badge_id'])
badge_df.to_csv('badge_id.csv')
badge_df.to_sql('badge_id', engine, if_exists = 'fail', index = False)

In [1083]:
badges.to_csv('badges.csv')
badges.to_sql('badges', engine, if_exists = 'replace', index = False)

25

In [1084]:
# any data cleaning still missing here? take a look at the description
schools = pd.concat(schools_list)

schools.drop(['LogoUrl'], axis = 1, inplace = True, errors = 'ignore')
schools['description'] = schools['description'].str.replace(r'<[^<>]*>', '', regex=True)
schools['website'] = schools['website'].str.split('/', n = 1).str[0]
schools['website'] = schools['website'].str.split('?', n = 1).str[0]
schools.head(10)

,website,description,school,school_id
0,flatironschool.com,Founded in 2012 and started the bootcamp revol...,flatiron-school,10748
0,generalassemb.ly,General Assembly is creating a global communit...,general-assembly,10761
0,datasciencedojo.com,Data Science Dojo believes that anyone can lea...,data-science-dojo,10685
0,www.ironhack.com,Ironhack is a global tech school with 9 campus...,ironhack,10828
0,www.lewagon.com,Le Wagon is a global leader in immersive tech ...,le-wagon,10868
0,wildcodeschool.com,Wild Code School offers 5-month web developmen...,wild-code-school,11169
0,www.thedevmasters.com,The goal of theDevMasters is to build the next...,the-dev-masters,11077
0,byteacademy.co,Byte Academy is a leader in industry-oriented ...,byte-academy,10574
0,www.thedataincubator.com,The Data Incubator is a full-stack data scienc...,the-data-incubator,11074
0,brainstation.io,BrainStation is the global leader in workforce...,brainstation,10571

In [1085]:
schools.to_csv("schools.csv")
schools.to_sql('schools', engine, if_exists = 'replace', index = False)

10

In [ ]:
cnx.commit

In [ ]:
cursor.close

In [ ]:
cnx.close